package com.sdyin.dsag.arithmetic.alg.leetcode;

import java.util.Arrays;

/**
 * @Description: 135.分发糖果
 * //老师想给孩子们分发糖果，有 N 个孩子站成了一条直线，老师会根据每个孩子的表现，预先给他们评分。
 * //
 * // 你需要按照以下要求，帮助老师给这些孩子分发糖果：
 * //
 * //
 * // 每个孩子至少分配到 1 个糖果。
 * // 相邻的孩子中，评分高的孩子必须获得更多的糖果。
 * //
 * //
 * // 那么这样下来，老师至少需要准备多少颗糖果呢？
 * //
 * // 示例 1:
 * //
 * // 输入: [1,0,2]
 * //输出: 5
 * //解释: 你可以分别给这三个孩子分发 2、1、2 颗糖果。
 * //
 * //
 * // 示例 2:
 * //
 * // 输入: [1,2,2]
 * //输出: 4
 * //解释: 你可以分别给这三个孩子分发 1、2、1 颗糖果。
 * //     第三个孩子只得到 1 颗糖果，这已满足上述两个条件。
 * // Related Topics 贪心算法
 * // 👍 377 👎 0
 * @Author: liuye
 * @time: 2020/12/24$ 下午2:58$
 */
public class Candy135 {

    /**
     * 算法思路：
     * 初始每个孩子1颗糖
     * 从左开始，如果 i> i-1,则第i个孩子多一颗糖
     *          如果 i <= i-1,则不变,忽略
     * 再从右开始,如果 i > i+1,则第i个孩子多一颗糖
     *          如果 i <= i+1,则不变,忽略
     *
     */
    public static int candy(int[] ratings) {

        int[] left = new int[ratings.length];
        int[] right = new int[ratings.length];
        Arrays.fill(left, 1);
        Arrays.fill(right, 1);
        //从左遍历
        //注意.左右遍历的数组是两个数组，不是共享的一个数组
        for (int i = 1; i < ratings.length; i++) {
            if (ratings[i] > ratings[i - 1]) {
                left[i] = left[i - 1] + 1;
            }
        }
        //最左的糖果值
        int count = left[ratings.length - 1];
        //从右遍历
        for (int i = ratings.length - 2; i >= 0; i--) {
            if (ratings[i] > ratings[i + 1]) {
                right[i] = right[i + 1] + 1;
            }
            //累加
            count += Math.max(left[i], right[i]);
        }
        return count;
    }

    public static void main(String[] args) {
        int[] arr = {1,2,3,3,5};
        final int result = candy(arr);
        System.out.println(result);
    }
}
